{
    "phrases": [
        {"Question": "What do you like to drink your dinner?"},
        {"Question": "Do you drink a lot water every day?"},
        {"Question": "Do you prefer tea or coffee?"},
        {"Question": "if people visit in your home what do you usually offer them to drink"},
        {"Question": "what did you study in history lessons when you were to school?"},
        {"Question": "how often do you watch TV programs about history now"},
        {"Question": "what period in history would you like to learn more about now"},
        {"Question": "How often do you buy things online"},
        {"Question": "what was the last thing you bought online"},
        {"Question": "Did you have a favorite book when you were a child?"},
        {"Question": "How much reading do you do for your work or studies?"},
        {"Question": "What kinds of books do you read for pleasure?"},
        {"Question": "Do you prefer to read a newspaper or a magazine online or to buy a copy?"},
        {"Question": "What kinds of bills do you have to pay?"},
        {"Question": "How do you usually pay your bills in cash or by another method?"},
        {"Question": "Is there anything you could do to make your bills cheaper?"},
        {"Question": "How many hours do you usually sleep at night?"},
        {"Question": "Do you sometimes sleep during the day?"},
        {"Question": "What do you do if you can't get to sleep at night?"},
        {"Question": "Do people usually use public transportation in your country?"},
        {"Question": "What kind of public transportation do people in your country use the most?"},
        {"Question": "What would you change about public transport?"},
        {"Question": "Will you ride public transportation in the future?"},
        {"Question": "What are the different forms of pollution you know?"},
        {"Question": "Can you describe a place you visited that was affected by pollution?"},
        {"Question": "What kinds of pollution do cities have?"},
        {"Question": "Why don't some people care about the environment?"},
        {"Question": "Do you think there is more or less pollution than in the past? How about the future?"},
        {"Question": "What should we do about environmental pollution?"},
        {"Question": "What kind of pets are common where you live?"},
        {"Question": "Did you have a pet as a child?"},
        {"Question": "Do you enjoy visiting people who have pets at home?"},
        {"Question": "Are there any animals you would never keep as a pet?"},
        {"Question": "Where can people in your country see a wild animal?"},
        {"Question": "When was the last time you visited a zoo?"},
        {"Question": "What animals have you seen in the wild?"},
        {"Question": "Do you like watching TV programs about wild animals?"},
        {"Question": "Did you study art at school?"},
        {"Question": "Do you enjoy creating art? Why or why not?"},
        {"Question": "Have you ever visited an art gallery?"},
        {"Question": "If you could be good at one type of art, what would it be?"},
        {"Question": "What was your first mobile phone like?"},
        {"Question": "Do you use your mobile phone mainly for work or for personal reasons?"},
        {"Question": "What features do you consider most important in a mobile phone?"},
        {"Question": "Are there times when you prefer not to use your mobile phone?"},
        {"Question": "Did you learn about the law at school?"},
        {"Question": "Do people generally follow the traffic laws where you live?"},
        {"Question": "Do you enjoy watching films about crime?"},
        {"Question": "Would you like to be a police officer? Why or why not?"},
        {"Question": "How often do you talk to your neighbors?"},
        {"Question": "Have you ever helped a neighbor with a problem?"},
        {"Question": "How important is it to you to like your neighbors?"},
        {"Question": "Would you like to live in a place where neighbors know each other well?"},
        {"Question": "Are there many museums where you live?"},
        {"Question": "When did you last visit a museum?"},
        {"Question": "Is it more enjoyable to visit a museum or read a history book?"},
        {"Question": "Do you like visiting museums when you travel overseas?"},
        {"Question": "Did you have a favorite teacher at primary school?"},
        {"Question": "Which subjects did you enjoy in high school?"},
        {"Question": "Would you like to be a teacher?"},
        {"Question": "Do you think that schools in the future will be different from the schools you went to?"},
        {"Question": "Did you have a favorite film when you were a child?"},
        {"Question": "What kinds of films do you enjoy now?"},
        {"Question": "How popular are foreign films in your country?"},
        {"Question": "Do you prefer watching films in a cinema or at home?"},
        {"Question": "Did you learn about environmental issues at school?"},
        {"Question": "Are there many environmental problems in your country?"},
        {"Question": "Do you often discuss environmental topics with other people?"},
        {"Question": "What are some of the things you do to help protect the environment?"},
        {"Question": "Is family important in your country?"},
        {"Question": "Do you have a large family?"},
        {"Question": "Who are you closest to in your family?"},
        {"Question": "Do you prefer spending time with family or friends?"},
        {"Question": "What is your favorite food?"},
        {"Question": "Have your food preferences changed since childhood?"},
        {"Question": "Do you enjoy eating in restaurants?"},
        {"Question": "What kind of food would you like to try?"},
        {"Question": "Have you ever grown any food?"},
        {"Question": "What kind of foods grow near where you live?"},
        {"Question": "How popular is growing your own food among the people you know?"},
        {"Question": "Would you prefer to grow food or to grow flowers?"},
        {"Question": "How do you usually access the news?"},
        {"Question": "When was the last time you bought a newspaper?"},
        {"Question": "Are you more interested in local news or world news?"},
        {"Question": "Do you enjoy discussing global issues with other people?"},
        {"Question": "How often do you exercise?"},
        {"Question": "Do you do the same type of exercise now as when you were younger?"},
        {"Question": "Do you prefer exercising indoors or outdoors?"},
        {"Question": "Is there anything you would like to change about your exercise habits?"},
        {"Question": "Do you enjoy learning about health?"},
        {"Question": "What do you do to take care of your health?"},
        {"Question": "Do you search for health information online?"},
        {"Question": "Is there anything you could do to be healthier?"},
        {"Question": "When did you first start using social media?"},
        {"Question": "What do you use social media for?"},
        {"Question": "Do you sometimes share too much information on social media?"},
        {"Question": "Do you think you will spend more or less time on social media in the future?"},
        {"Question": "Did you get pocket money as a child?"},
        {"Question": "How difficult is it for you to save money?"},
        {"Question": "Do most people in your country use cash, credit cards, or payment apps?"},
        {"Question": "Is there anything you could do to earn more money?"},
        {"Question": "How did you learn to use a computer?"},
        {"Question": "What is your favorite computer program or application?"},
        {"Question": "Have you ever had a problem with a computer?"},
        {"Question": "Would you like to improve your computer skills?"},
        {"Question": "Did you learn about space as a child?"},
        {"Question": "Do you ever gaze at the stars?"},
        {"Question": "Do you enjoy TV programs about space?"},
        {"Question": "Do you think it would be interesting to visit other planets?"},
        {"Question": "Which sports are popular in your country?"},
        {"Question": "Do you enjoy watching sports?"},
        {"Question": "What places are there for playing sport near where you live?"},
        {"Question": "Is there any kind of sport you would never do? Why?"},
        {"Question": "At what age do most people in your country learn to drive?"},
        {"Question": "Do you know how to drive a car?"},
        {"Question": "How important is it to you to be able to drive?"},
        {"Question": "Do you think it is more enjoyable to be a driver or a passenger in a car?"},
        {"Question": "Does your hometown have a good public transport system?"},
        {"Question": "How often do you take public transport?"},
        {"Question": "Have you ever had a problem on public transport?"},
        {"Question": "What would you like to change about the public transport system where you live?"},
        {"Question": "Have you traveled a lot?"},
        {"Question": "Do you prefer planning your trip or letting someone else do it?"},
        {"Question": "Who do you prefer to travel with?"},
        {"Question": "Where would you like to travel to in the future?"},
        {"Question": "Have you ever had a partime job?"},
        {"Question": "How do people in your country usually search for work?"},
        {"Question": "Would you prefer to work for a small company or a large organization?"},
        {"Question": "If you did not need money, would you still work?"},
        {"Question": "Have you changed a lot since your childhood?"},
        {"Question": "What do you plan to change next year?"},
        {"Question": "Do you like changes? Why?"},
        {"Question": "Are there any changes in your hometown?"},
        {"Question": "What indoor games do children like to play nowadays?"},
        {"Question": "What’s the difference between the games children play now and those in the past?"},
        {"Question": "Can children benefit from playing computer games?"},
        {"Question": "What’s the difference between boys' and girls' games?"},
        {"Question": "Do you like shopping?"},
        {"Question": "Do you compare prices when you shop? Why?"},
        {"Question": "Is it difficult for you to make choices when you shop?"},
        {"Question": "Do you think expensive products are always better than cheaper ones?"},
        {"Question": "Who should be responsible for conserving old buildings?"},
        {"Question": "Do you think the appearance of a building is important?"},
        {"Question": "What is the most important to a public building: design, location, or facilities?"},
        {"Question": "Do more people prefer to live in houses or apartments in your country?"},
        {"Question": "Do you often stay up late?"},
        {"Question": "What do you do when you stay up late?"},
        {"Question": "How do you feel when you have stayed up late the night before?"},
        {"Question": "What are the bad effects of staying up late?"},
        {"Question": "Is it difficult for people in your country to express their feelings?"},
        {"Question": "Who do you think talk more, children or adults?"},
        {"Question": "What is the difference between males and females in terms of expressing their feelings?"},
        {"Question": "Why do you think people these days are not as open compared to those in the past?"},
        {"Question": "Why did you choose to do that type of work?"},
        {"Question": "Do you miss being a student?"},
        {"Question": "Do you like your job?"},
        {"Question": "Why did you choose to study those subjects?"},
        {"Question": "What subjects did you study?"},
        {"Question": "Do you prefer to study in the mornings or in the afternoons?"},
        {"Question": "Are you looking forward to working?"},
        {"Question": "Do you like your subject?"},
        {"Question": "What kind of expensive things do people like to buy?"},
        {"Question": "What's the difference between women and men in buying things?"},
        {"Question": "What are the advantages and disadvantages of being rich?"},
        {"Question": "Why are some sports expensive? Are they for everyone?"},
        {"Question": "Do you like meeting new people?"},
        {"Question": "How do you feel when people welcome you?"},
        {"Question": "Do you often meet new people?"},
        {"Question": "Can you tell if you like someone when you meet them for the first time, and why?"},
        {"Question": "How can children feel happy?"},
        {"Question": "What's the difference between adults' and children's happiness?"},
        {"Question": "Do you think everyone shares the same definition of happiness?"},
        {"Question": "Some people say that living in a happy city is boring. What do you think?"},
        {"Question": "Do you prefer to read newspapers or magazines?"},
        {"Question": "Do you prefer to read news online or in newspapers?"},
        {"Question": "What kinds of newspapers do you usually read?"},
        {"Question": "How old were you when you first started to read newspapers?"},
        {"Question": "Do you think it's important to read newspapers?"},
        {"Question": "Why do people read newspapers?"},
        {"Question": "What different types of newspapers are there in your country?"},
        {"Question": "Do you care about the news?"},
        {"Question": "Among the different science categories you typically learn in school, which do you like the most and why?"},
        {"Question": "What's the best invention in the past 100 years?"},
        {"Question": "What's the influence of science on human life?"},
        {"Question": "What can individuals do for scientific research?"},
        {"Question": "What influence can international cooperation in science bring about?"},
        {"Question": "What do you usually do on the weekends?"},
        {"Question": "Did you do anything special last weekend?"},
        {"Question": "What will you do next weekend?"},
        {"Question": "What do other people in your hometown usually do on weekends?"},
        {"Question": "Where can people hear a lot of noise?"},
        {"Question": "What may happen if one listens to very loud music using earphones when running or hiking?"},
        {"Question": "What can be done to reduce traffic noise?"},
        {"Question": "Do you think the world will be noisier in the future?"},
        {"Question": "What do you always do in a hurry?"},
        {"Question": "What kind of things would you never do in a hurry?"},
        {"Question": "Do you usually go out in a hurry?"},
        {"Question": "Do you like to be in a hurry?"},
        {"Question": "When you were young, did you ever take private classes?"},
        {"Question": "What skills should children learn before school?"},
        {"Question": "What's the difference between the roles of teachers and parents in education?"},
        {"Question": "How do adults learn a new skill?"},
        {"Question": "Is the internet good for learning new skills?"},
        {"Question": "Did you go on a picnic when you were a child?"},
        {"Question": "How often do you go on a picnic now?"},
        {"Question": "Where do you go on a picnic?"},
        {"Question": "What is the difference between a picnic and cooking at home?"},
        {"Question": "What's the influence of social media on friendship?"},
        {"Question": "Why do people lose contact with their friends after graduation?"},
        {"Question": "Do people in your country like to make new friends?"},
        {"Question": "Do you think old friends are more important to the old generation or the young generation?"},
        {"Question": "Do you make a list when you shop?"},
        {"Question": "Do you make a list for your work? Does it work?"},
        {"Question": "Why don't some people like making lists?"},
        {"Question": "Do you prefer to make a list on paper or on your phone?"},
        {"Question": "What kind of clothes do you usually wear?"},
        {"Question": "Who is usually the breadwinner in a family in your country?"},
        {"Question": "How do grandparents take care of grandchildren?"},
        {"Question": "What's the most important quality of parents?"},
        {"Question": "How can new parents learn about parenting?"},
        {"Question": "What was the first time you talked in a foreign language?"},
        {"Question": "At what age should children start learning a foreign language?"},
        {"Question": "Which skill is more important, speaking or writing?"},
        {"Question": "Does a person still need to learn other languages if they are good at English?"},
        {"Question": "Do you think minority languages will disappear?"},
        {"Question": "What kind of housing accommodation do you live in currently?"},
        {"Question": "Do you plan to live there for a long time?"},
        {"Question": "Are the transport facilities to your home very good?"},
        {"Question": "Do you prefer living in a house or a flat?"},
        {"Question": "What part of your home do you like the most?"},
        {"Question": "Can you describe the place where you live?"},
        {"Question": "Which room does your family spend most of the time in?"},
        {"Question": "Who is an energetic person that you know?"}
    ]
}